<html>
<head>
<meta http-equiv="expires" content="21600">
<link href="../main.css" rel="stylesheet" media="all"></link>
<script src="../astatus.js" type="text/javascript"></script>
<script type="text/javascript">
function mailpopup (Adresse) {
  fenster = window.open(Adresse, "fenster3", "width=640,height=409,left=50,top=50,dependent=no,location=no,menubar=no,resizable=no,scrollbars=no,status=no,toolbar=no");
  fenster.focus();
}
function skamp (Adresse) {
  fenster = window.open(Adresse, "skampw", "width=370,height=628,left=250,top=50,dependent=no,location=no,menubar=no,resizable=no,scrollbars=no,status=no,toolbar=no");
  fenster.focus();
}
</script>

</head>

<body>

<div class="titel">
News
</div>

<br>
<div class="lefty">
<div class="ueberschrift2">1<font size=-1>0</font>.<font size=-1>0</font>1.2<font size=-1>0</font>1<font size=-1>0</font> Small Buisness</div>
<div class="news">
Hey Dudes, ein kleines Update im neuen Jahr: <a href="pics/091204_road/index.html">Fotos</a> Online! Nicht nur seit einer gef&uuml;hlten Ewigkeit, sondern nach einer tats&auml;chlichen, gibt ein paar wenige Fotos von unserem Gig im Roadhouse. Vielen Dank an <a href="http://www.h3-production.de" target="_blank">Harry</a> f&uuml;r die tollen Schnappsch&uuml;sse.
<div align="right"></div>
</div></div>

<br><br>
<div class="righty">
<div class="ueberschrift2">21<font size=-1></font>.1<font size=-1></font>2.2<font size=-1>00</font>9 Heavy Metal X-Mas...</div>
<div class="news">
<i>...und die Maschinerie der Abtr&uuml;nnigen erhob sich mit letzter Kraft um voller Inbrunst einen markersch&uuml;tternden Schrei in den K&ouml;pfen der Erdenbewohnern festzusetzen.</i><br>
Angefangen mit der Show in G&uuml;tersloh, &uuml;ber das Roadhouse/ Wohnzimmmer Wochenende bis hin zum Pre-X-Mas Schnee Chaos in der westf&auml;lischen Welt war es f&uuml;r uns ein hammer Jahresabschluss. Vielen vielen Dank f&uuml;r die fantastische Unterst&uuml;tzung, positive wie negative Resonanz und das gemeinsame Abfeiern.<br>
Ein F&uuml;nftel des <b>Battles</b> verschl&auml;gt es anfang des n&auml;chsten Jahres leider wieder ans andere Ende der Welt, sodass es vorerst nichts Neues von uns geben wird. Jedoch sind f&uuml;r die Zeit darauf schon neue Schandtaten geplant. Mehr wird aber an dieser Stelle nicht verraten!<br>
Ein Schmankerl am Schluss, das nichts mit uns zu tun hat, aber das wir mit einem breiten Grinsen aufgenommen haben und nicht unerw&auml;hnt lassen wollen. Der <i>inbr&uuml;nstige Schrei, der sich in jedem kopf festsetzten soll: Fuck you, I won't do what you tell me!</i><br>
<b>Rage Against The Machine</b> schaffen es durch eine auf Facebook losgetretene Initiative in die <a href="../img/ratm.jpg" target="_blank">X-Mas Charts UK</a> und verweisen den diesj&auml;hrigen Gewinner Joe McElderry der X-Factor Casting Show auf den zweiten Platz, obwohl in den letzten vier Jahren jeweils der Gewinner eben jener Show die wichtige Poleposition in der letzten Woche vor Weihnachten f&uuml;r sich sichern konnte. Doch nicht dieses Jahr! <i>Die Leute haben die Schnauze voll davon, eine Schmalzballade nach der anderen serviert zu bekommen</i> kommentierte ein erfeuter Tom Morello <a href="http://www.laut.de/vorlaut/news/2009/12/18/23980/" target="_blank">die Situation</a>. <b>RATM</b> setzen noch einen drauf:<br>
W&auml;hrend einer Radio Sendung halten sie sich nicht an das Abkommen mit dem Sender, und singen die ungek&uuml;rzte Textzeile <i>Fuck you, I won't do what you tell me!</i> und verleihen damit ihren Worten noch einen zust&auml;tzlichen Kick!<br>
Hell Yeah, We Love It!!<br><br><br>
<center><img src="../img/borfilm.jpg" border="0"></center><br>
<div align="right">...And A Headbangin' New Year!</div>
</div></div>

<br><br>
<div class="lefty">
<div class="ueberschrift2"><font size=-1>11</font>.<font size=-1></font>11.2<font size=-1>00</font>9 Fuckin Scream: Helau, yeah?!</div>
<div class="news">
<center><a href="flyer/20091121/flyer_korr.jpg" target="_blank"><img src="flyer/20091121/flyer_korr_s.jpg" border="0"></a></center>
<div align="right"></div>
</div></div>

<br><br>
<div class="righty">
<div class="ueberschrift2"><font size=-1>0</font>9.<font size=-1>0</font>9.2<font size=-1>00</font>9 Wort zum Sonntag</div>
<div class="news">
... hey dudes, here we are. Ein riesiges Dankesch&ouml;n geht an alle, die uns am Sonntag auch nach unserer etwa einj&auml;hrigen B&uuml;hnenabstinez und trotz des drohenden Wochenbeginns bis sp&auml;t in die Nacht unterst&uuml;tzt haben.<br>
F&uuml;r alle, die nicht dabei waren, haben wir hier eine kurze Zusammenfassung: Den Anfang des Abends machte die noch junge Band <b>Tash</b> und w&auml;rmte die B&uuml;hne mit ihrem Livedeb&uuml;t ordentlich auf, bevor <b>Who killed Preppy?!</b> an die Instrumente durfte, f&uuml;r die es wiederum vorerst die letzte Show war, da es einen ihrer Gitarristen f&uuml;r ein Jahr ins Ausland zieht.<br>
Zur Prime Time gab es dann schließlich Dampf auf der B&uuml;hne - <b>Hans Dampf</b>. Mit Luft im Kopf ließen sie ihre Fans sich im Kreis drehen und sorgten mit ihren durchdachten Texten und inklusive einer Samba f&uuml;r ausgelassene Stimmung in allen Reihen bis sie leider durch The Juke von der B&uuml;hne verbannt wurden.<br>
Als letzte Band wurden unsere <b>Renegade Amps</b> letztendlich gegen halb elf aus ihrem Standby geweckt um der versammelten H&ouml;rerschaft nach der aufgezwungenen Zugabe wieder ordentliche Musik zu bieten. Es gab bestimmt schon bessere Shows, aber es hat uns gepackt und wir fiebern nun mehr als zuvor unserer Nikolausshow am <a href="http://www.jugendkulturring.info/index.php?page=events&id=32" target="_blank">4. Dezember</a> im <a href="http://roadhouse-germany.de/hotdates.html" target="_blank">Roadhouse</a> entgegen.<br>
Wir werden uns &uuml;ber jeden freuen, der dort mit uns abfeiert!
<br><br><div align="right">Santa Claus Kills The Jukebox</div>
</div></div>

<br><br>
<div class="lefty">
<div class="ueberschrift2"><font size=-1>3</font>0.<font size=-1>0</font>8.2<font size=-1>00</font>9 Warmup Downhill Megajam!</div>
<div class="news">
Listen up dudes, Langenberg wird berockt! Relativ kurzfristig bekommt ihr hier die News, dass wir zusammen mit <b>The Juke</b>, <b>Who Killed Preppy?!</b> und <b>Hans Dampf</b> am 6. September in Langenberg auf der B&uuml;hne stehen werden. Im Zuge des ersten Jukestock Bandfestivals wird es ab 18.00h Ortszeit im Festzelt Langeberg heiß und laut.<br><br>
Etwas versp&auml;tet senden wir euch auch noch eine im Lippsta&auml;dter Blicker erschienenen Artikel &uuml;ber die <a href="http://www.blicker-lippstadt.de/Stadtkulturmacher/stadtkulturmacher.php?id=15" target="_blank">Schlacht der Ausgestoßenen</a>!
<br><br><div align="right">Listen And Repeat!</div>
</div></div>

<br><br>
<div class="righty">
<div class="ueberschrift2"><font size=-1>0</font>7.<font size=-1>0</font>8.2<font size=-1>00</font>9 Fuckin' Hell Yeah!</div>
<div class="news">
Incredible! 1 Jahr, 1 Monat, 1 Tag und wom&ouml;glich auch noch eine Stunde ist es jetzt her, dass die letzte News aus der <b>Renegadeszantrale</b> posaunt wurde. Viel zu lange!<br>
Nicht allein aus diesem Grund gibt es an dieser Stelle etwas zu verk&uuml;nden. Z&uuml;ckt eure Schreiber und notiert folgendes Datum in euren Terminplanern und Wandkalendern:<br>
<br><center><b>04. Dezember 2009</b></center><br>
Sagt alles ab und kommt am 4.12.2009 ins Roudhouse Wiedenbr&uuml;ck - Das meint nicht nur der <a href="http://kultur-von-morgen.de/index.php?page=events&id=32" target="_blank">Jugendkulturring</a> und l&auml;dt an besagtem Freitag zu <b>Roquefort</b> und <b>Battle Of Renegades</b>.<br>
Wir fiebern einem fetten Abend mit viel Bier, Schweiß und Rock'n'Roll entgegen und freuen uns m&ouml;glichst viele von euch dort zu treffen.
<br><br><div align="right">Just Flip It All To Rock'n'Roll!</div>
</div></div>

<br><br>
<div class="lefty">
<div class="ueberschrift2"><font size=-1>0</font>6.<font size=-1>0</font>7.2<font size=-1>00</font>8 BoR Meets...</div>
<div class="news">
...Schweinekamp Open Air! An unserem ersten Open Air <a href="http://www.getoese-in-moese.de" target="_blank">&#x84;Get&ouml;se in M&ouml;se&#x93;</a> Feuer gefangen, rocken wir nun Anfang August auch gleich auf einem weiteren Festival. Das <a href="flyer/20080802/flyer_s.html" onclick="skamp(this.href); return false">Schweinekamp Open Air</a> wird am 2. August 2008 in Bad Iburg, Sentrup stattfinden. Ebenfalls auf der Bühne anzutreffen sind: Emperor's New Clowns, Tihuana Toads, New Manifest und Block.<br>
Desweiteren k&ouml;nnt ihr jetzt auch auf unserer Seite eine Auswahl an Bildern vom 28 Juni finden. Besten Dank an <a href="http://www.gregormichaelhennig.de" target="_blank">Gregory</a>, der die Zeit gefunden hat, uns als Fotograph zu begleiten.
<br><br><div align="right">The Devil Said: Let's Rock!</div>
</div></div>

<br><br>
<div class="righty">
<div class="ueberschrift2"><font size=-1>0</font>2.<font size=-1>0</font>7.2<font size=-1>00</font>8 Now We Know ...</div>
<div class="news">
<img src="news_pics/20080702/01.jpg" style="float:right; margin-right:0px; margin-left:3px; margin-bottom:3px; margin-top:3px;">...Who Got The Balls: M&ouml;se! Danke, danke, danke. Die <b>Renegades</b> haben das Get&ouml;se Festival heil &uuml;berstanden und danken allen Rockern, Veranstaltern und den anderen Bands f&uuml;r diese fantastische Party am vergangenen Samstag. Das Wetter war perfekt, der Sound ebenfalls und das Bier erst recht. &Uuml;berzeugt euch selbst - Die ersten Fotos sind <a href="http://www.getoese-in-moese.de" target="_blank">online</a>.
<br><br><div align="right">Watch Out!</div>
</div></div>

<br><br>
<div class="lefty">
<div class="ueberschrift2">14.<font size=-1>0</font>6.2<font size=-1>00</font>8  Tales Of Interest ...</div>
<div class="news">
Listen Up, Listen Up! Die <a href="http://www.getoese-in-moese.de" target="_blank">M&ouml;se</a> r&uuml;ckt n&auml;her und n&auml;her, und jetzt haben wir eine Info, die euch interessieren k&ouml;nnte: Wenn ihr uns bis Mitte n&auml;chster Woche eine <a href="mail_popup/index.html" onclick="mailpopup(this.href); return false">Mail</a> mit eurem Namen schickt, k&ouml;nnt ihr euch damit eine Eintrittskarte zum Vorverkaufspreis von 7,- Euro reservieren (AK 9,- Euro). Diese wird dann am Eingang hinterlegt, wo ihr sie direkt am 28. Juni abholen k&ouml;nnt.<br>
Wenn ihr bis dahin zwischendurch mal Zeit f&uuml;r einen Klick habt, spitzt eure Lauscher, seit ein <b>Renegade</b> und klickt hier: <a href="http://www.myspace.com/Originaltext" target="_blank">Originaltext</a> ist der erste Gehversuch von <b>Jan</b>, mit dem er sich in ein neues Territorium wagt und etwas andere T&ouml;ne anschl&auml;gt.<br><br><div align="right">Go Now And Spread These News.</div>
</div></div>

<br><br>
<div class="righty">
<div class="ueberschrift2">1<font size=-1>5</font>.<font size=-1>0</font>4.2<font size=-1>00</font>8 On The Road Again ...</div>
<div class="news">
Es gibt einen neuen Eintrag f&uuml;r eure Terminplaner! Zwar dauert es noch etwas bis dahin, aber am 28. Juni werden die Renegades dieses Jahr auf dem Mastholter <b>Open Air</b> <a href="http://www.getoese-in-moese.de" target="_blank">Getoese in Moese</a> zu sehen sein. Wir hoffen m&ouml;glichst viele von euch dort anzutreffen um mit uns die Fete gemeinsam durchzuziehen!<br><br><div align="right">Take A Pen And Take The Note!</div>
</div></div>

<br><br>

<div class="lefty">
<div class="ueberschrift2"><font size=-1>0</font>4.<font size=-1>0</font>4.2<font size=-1>00</font>8 Take A Look...</div>
<div class="news">
<img src="news_pics/20080404/01.jpg" style="float:left; margin-right:3px; margin-left:0px; margin-bottom:3px; margin-top:3px;">...At The New Pics! Die <a href="pics.html" target="frame_content">Bilder</a> von unserem Auftritt im Roadhouse sind jetzt endlich online. Schaut sie euch an! Vielen Dank an <a href="http://www.klauswolter.de" target="_blank">Klaus</a>, dass er die n&ouml;tige Zeit aufbringen konnte, um diese geilen Schnappsch&uuml;sse zu  machen.<br>In der Rubrik <a href="band.html" target="frame_content">Band</a> k&ouml;nnt ihr auch etwas neues finden. Die Abteilung <a href="press.html" target="frame_content">The Pressannounces</a> hat ge&ouml;ffnet und freut sich &uuml;ber reichlich Klicks! Falls ihr weitere Artikel findet, k&ouml;nnt ihr uns diese gerne zusenden, dann stellen wir sie mit in das Archiv.<br><br><div align="right">Folks: Stop Readin' - Start Klickin', Aight?!</div>
</div></div>

<br><br>

<div class="righty">
<div class="ueberschrift2">3<font size=-1>0</font>.<font size=-1>0</font>3.2<font size=-1>00</font>8 The Day After...</div>
<div class="news">
Zu allererst ein riesen fettes Dankesch&ouml;n an alle, die gestern bei unserem Roadhouse Auftritt waren und so dermaßen gerockt haben: DANKE!<br>
Nachdem wir am Freitag schon zum zweiten Mal in den  K&ouml;lner Sae Studios waren, und dort einen weiteren Song aufgenommen haben, freuen wir uns, dass gestern auch der Abschluss und H&ouml;hepunkt unserer <b>Renegade Week</b> vor ungef&auml;hr 250 G&auml;sten gerockt hat und die viele Zeit im Proberaum an Amps, Drums & Mics nicht vertan war.<br>
An dieser Stelle auch ein Dankesch&ouml;n sowohl an das Roadhouse für die Location, als auch an Queen Mom und The Picturebooks f&uuml;r ihre Unterst&uuml;tzung und das Anheizen!<br><br>
Ab jetzt werden wir aus privaten Gr&uuml;nden erstmal in aller Ruhe weiter an neuem Material arbeiten und hoffen, dass wir Euch eventuell in diesem Festival Sommer auf einem der lokalen Open Airs sehen k&ouml;nnen.<br>
Fotos aus K&ouml;ln und natürlich auch aus dem Roadhouse werden erst in den n&auml;chsten Tagen folgen.<br><br><div align="right">In diesem Sinne: Stay Tuned & Watch Out!</div>
</div></div>

<br><br>

<div class="lefty">
<div class="ueberschrift2">24.<font size=-1>0</font>3.2<font size=-1>00</font>8 BoR On Air...</div>
<div class="news">
<img src="news_pics/20080324/1.jpg" style="float:left; margin-right:3px; margin-left:0px; margin-bottom:3px; margin-top:3px;">...in Cologne/M&uuml;hlheim. Am letzten Wochenende waren wir endlich in K&ouml;ln, um dort einiges Audiomaterial in den Sae Studios f&uuml;r die Nachwelt festzuhalten. Leider hat uns <b>The Master Of Hellfire Himself</b> einige technische H&uuml;rden in den Weg gestellt, die wir nur schwer <img src="news_pics/20080324/2.jpg" style="float:right; margin-right:0px; margin-left:3px; margin-bottom:1px; margin-top:2px;">&uuml;berwinden konnten. So haben wir es leider nur zu einem Song gebracht, der sich zur Zeit in der Nachbearbeitung beim Mischen befindet. Sobald wir das Ergebnis haben, werdet Ihr es erfahren. Bis dahin k&ouml;nnt Ihr euch ein paar <a href="pics.html" target="frame_content">Bilder</a> von diesem Trip angucken.<br><br><div align="right">Creatures Of The Night: Watch Out!</div>
</div></div>

<br><br>

<br>

<div class="righty">
<div class="ueberschrift2">14.<font size=-1>0</font>2.2<font size=-1>00</font>8 Turn The Music On!</div>
<div class="news">
Dudes, the story goes on. Wir fiebern dem M&auml;rz entgegen, denn der Termin f&uuml;r unseren K&ouml;ln Trip steht und im Zuge der Vorbereitung haben wir schon einiges Material im Proberaum aufgenommen. Ihr k&ouml;nnt euch einen kleinen Ausschnitt von &#x84;Being Drunken&#x93; in den <b>Renegade Amp</b> laden und reinh&ouml;ren.
</div></div>


<br><br>

<div class="lefty">
<div class="ueberschrift2"><font size=-1>0</font>9.<font size=-1>0</font>2.2<font size=-1>00</font>8 Here we Are Again...</div>
<div class="news">
...with some fucking incredible news - So listen up:<br>Das <b>Renegade Radio</b> wurde jetzt durch einen kompletten <b>Renegade Amp</b> abgel&ouml;st! Schaltet ihn einfach mal an und seht was er leistet.<br>
Zudem sind wir im dritten Monat diesen Jahres in die Sae Studios in K&ouml;ln eingeladen worden. Dort werden wir zusammen mit Mazen ein oder zwei Songs aufnehmen. Wir halten euch auf dem Laufenden, denn vielleicht verirrt sich auch eines der St&uuml;cke in den Renegade Amp.<br>
Alle guten Dinge sind Drei! Ende M&auml;rz, am 29.3.2008 werden wir zusammen mit <a href="http://www.queenmom.de" target="_blank">Queen Mom</a> und <a href="http://www.myspace.com/picturebooksthe" targeT="_blank">The Picturebooks</a> im <a href="http://www.roadhouse-germany.de" target="_blank">Roadhouse Wiedenbrück</a> spielen. N&auml;here Infos folgen...<br><br><div align="right">Let's Rock!</div>
</div></div>

<br><br>

<div class="righty">
<div class="ueberschrift2"><font size=-1>0</font>4.<font size=-1>0</font>2.2<font size=-1>00</font>8 There Is Something Comin' Soon.</div>
<div class="news">
Nach unserer kurzen musikabstinenten Phase, haben wir jetzt in den letzten Tagen und Wochen wieder angefangen, uns im Proberaum zu verschanzen, die Verstärker aufzudrehen und die Drums zu entstauben, um bald wieder was von uns hören und sehen zu lassen.
<br><br><div align="right">So Far: Stay Tuned & Keep Rocking! \m/</div>
</div></div>

<br>

</body>
</html>